migrate things to mermaidjs
